#include <bits/stdc++.h>
using namespace std;

// 0 1 2 3 4 5 6 7 8 9 -> 10

// 0 -> 00 01 02 03 04 05 06 07 08 09
// 1 -> 11 12 13 14 15 16 17 18 19
// ...
// 9 -> 99
// 10 + 9 + 8 + 7 + 6 + 5 + 4 + 3 + 2 + 1 = 55 -> (1 + 10) * 10 / 2

// 0 -> 000 001 002 003 004 005 006 007 008 009
//      011 012 013 014 015 016 017 018 019
// ...
//      099
// 1 -> 111 112 113 114 115 116 117 118 119
//      122 123 124 125 126 127 128 129
// ...
//      199
// 1 + (1 + 2 -> 3) + 6 + 10 + 15 + 21 + 28 + 36 + 45 + 55
// 888 889 899

// 0 -> 220개 -> 그냥 앞에 0 붙이기
// 1 -> 220 - 45 -> 앞에 1 붙이기

// dp[0][0] = 1 dp[0][1] = 1 ... dp[0][9] = 1 -> 합이 10
// dp[1][0] = 10 dp[1][1] = 9 ... dp[1][9] = 1 -> 합이 55


// 이차원 벡터로?

vector<vector<int>> dp;

int main() {
    ios::sync_with_stdio(false);
    cin.tie(nullptr);

    int N;
    cin >> N;

    dp.resize(N + 1);

    for (int i = 0; i <= N; i++) {
        if (i == 1) {
            dp[1].resize(10, 1);
        } else {
            dp[i].resize(10, 0);
        }
    }

    for (int i = 2; i <= N; i++) {
        dp[i][9] = 1;
        for (int j = 8; j >= 0; j--) {
            dp[i][j] = (dp[i][j + 1] + dp[i - 1][j]) % 10007;
        }
    }

    int result = 0;
    for (int i = 0; i < 10; i++) {
        result = (result + dp[N][i]) % 10007;
    }

    cout << result << "\n";
}
